squallbayu/votol-esp32-can-bus/esp32/votol_ble_dualcore/votol_ble_dualcore.ino
/*
 * =============================================
 * VOTOL BLE+WIFI DASHBOARD - ESP32 DUAL-CORE VERSION
 * =============================================
 * 
 * Author: Zekri R (ZEKRI.ID)
 * Website: https://zekri.id
 * 
 * Based on: https://github.com/yudhaime/displaypolytronfoxrs
 * 
 * =============================================
 * DUAL-CORE ARCHITECTURE
 * =============================================
 * Core 0: CAN Task (High Priority) - Dedicated CAN bus reading
 * Core 1: Comm Task - Handle BLE or WiFi data transmission
 * 
 * Transport Modes (Dual-Mode Startup):
 * - BOTH BLE + WiFi start active on boot for maximum accessibility
 * - First connection (BLE or WiFi) auto-disables the unused mode
 * - On disconnect, both modes re-activate (dual-mode ready again)
 * 
 * Benefits:
 * - Universal access: Android/iPhone/PC can all connect immediately
 * - Power efficient after connection (only one mode active)
 * - No manual mode switching required
 * =============================================
 * 
 * DISCLAIMER / PERINGATAN
 * =============================================
 * This project is provided "AS IS" without any warranty.
 * Use at your own risk. The author is NOT responsible
 * for any damage, malfunction, or injury to your vehicle,
 * controller, battery, or any other components.
 * =============================================
 */
#include <Arduino.h>
#include "driver/twai.h"
#include <atomic>

#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>

#include <Preferences.h>
#include "votol_ota.h"
#include "wifi_handler.h"

// === Vehicle Mode Enum (thread-safe) ===
// Must be defined before atomic usage
enum VehicleMode : uint8_t {
  MODE_PARK = 0,
  MODE_STAND,
  MODE_CHARGING,
  MODE_DRIVE,
  MODE_SPORT,
  MODE_REVERSE,
  MODE_BRAKE
};

// Mode to string lookup (for JSON output)
static const char* const modeStrings[] = {
  "PARK", "STAND", "CHARGING", "DRIVE", "SPORT", "REVERSE", "BRAKE"
};
static const uint8_t MODE_STRING_COUNT = sizeof(modeStrings) / sizeof(modeStrings[0]);

static inline const char* getModeString(VehicleMode m) {
  // Bounds check to prevent crash on corrupted/invalid enum value
  // Explicit cast to uint8_t for safety against compiler quirks
  uint8_t mVal = static_cast<uint8_t>(m);
  if (mVal >= MODE_STRING_COUNT) return "UNKNOWN";
  return modeStrings[mVal];
}

// === Transport Mode Enum (BLE vs WiFi) ===
#ifndef TRANSPORT_MODE_ENUM_DEFINED
#define TRANSPORT_MODE_ENUM_DEFINED
enum TransportMode : uint8_t {
  TRANSPORT_BLE = 0,      // BLE active, WiFi off
  TRANSPORT_WIFI,         // WiFi active, BLE off
  TRANSPORT_SWITCHING     // Transition state
};
#endif

// === CONFIGURATION ===
#define CAN_TX_PIN GPIO_NUM_21
#define CAN_RX_PIN GPIO_NUM_22
#define DEVICE_NAME "Votol_BLE"

#define LED_PIN 2

#define SERVICE_UUID        "4fafc201-1fb5-459e-8fcc-c5c9c331914b"
#define CHARACTERISTIC_UUID "beb5483e-36e1-4688-b7f5-ea07361b26a8"



// Timing - ADAPTIVE MODE-BASED for optimal performance
// Format: { FAST_MS, SLOW_MS }
// PARK/STAND: Slow updates, save power
static const uint32_t PARK_FAST_MS = 500;
static const uint32_t PARK_SLOW_MS = 2000;

// CHARGING: Medium speed, monitor charging data
static const uint32_t CHARGING_FAST_MS = 500;
static const uint32_t CHARGING_SLOW_MS = 2000;

// DRIVE/SPORT/REVERSE: Fast updates for real-time responsiveness
static const uint32_t DRIVE_FAST_MS = 100;
static const uint32_t DRIVE_SLOW_MS = 1000;

// BRAKE: Super fast for capturing peak regenerative amps
static const uint32_t BRAKE_FAST_MS = 50;
static const uint32_t BRAKE_SLOW_MS = 1000;

// Timeout constants (ms)
static const uint32_t CHARGER_TIMEOUT_MS = 5000;    // Reset charger status after no CAN msg
static const uint32_t ORI_CHARGER_TIMEOUT_MS = 5000; // Reset ORI charger detection
static const uint32_t SOC_PERIODIC_SAVE_MS = 3600000; // SOC periodic backup (1 hour)
static const uint32_t CAN_TIMEOUT_MS = 30000;       // CAN timeout = motor off (30s)
static const uint32_t INJECTOR_INTERVAL_MS = 500;   // Charger inject message interval
static const uint32_t MUTEX_TIMEOUT_MS = 5;         // Default mutex wait timeout

// BLE chunking - OPTIMIZED
static const uint16_t BLE_SAFE_CHUNK = 240;       // Keep safe for compatibility
static const uint32_t BLE_PUMP_BUDGET_US = 10000; // 10ms budget (was 6ms)
static const int BLE_PUMP_MAX_CHUNKS = 4;         // Less chunks per loop (was 12)

// Task configuration - OPTIMIZED
#define CAN_TASK_STACK_SIZE 4096
#define BLE_TASK_STACK_SIZE 8192
#define CAN_TASK_PRIORITY 3    // Higher priority for real-time CAN (was 2)
#define BLE_TASK_PRIORITY 1

// === RTOS Objects ===
SemaphoreHandle_t dataMutex = NULL;
SemaphoreHandle_t nvsMutex = NULL;  // Fix #2: Dedicated mutex for NVS access
TaskHandle_t canTaskHandle = NULL;
TaskHandle_t bleTaskHandle = NULL;

BLEServer* pServer = nullptr;
BLECharacteristic* pCharacteristic = nullptr;
std::atomic<bool> deviceConnected{false};  // Atomic: BLE callback (any core) + BLE task
bool oldDeviceConnected = false;

class MyServerCallbacks: public BLEServerCallbacks {
  void onConnect(BLEServer* pServer) override {
    deviceConnected.store(true, std::memory_order_release);
    Serial.println("[BLE] Client connected - staying in BLE mode");
    // WiFi should already be off when BLE is active
  }
  void onDisconnect(BLEServer* pServer) override {
    deviceConnected.store(false, std::memory_order_release);
    Serial.println("[BLE] Client disconnected (Staying in BLE mode)");
    // Do NOT switch to WiFi automatically
    // commTask will see deviceConnected=false and restart advertising
  }
};




// === SOC lookup table ===
const uint16_t socToBms[101] = {
  0, 60,70,80,90,95,105,115,125,135,140,150,160,170,180,185,195,205,215,225,
  230,240,250,260,270,275,285,295,305,315,320,330,340,350,360,365,375,385,395,405,
  410,420,430,440,450,455,465,475,485,495,500,510,520,530,540,550,555,565,575,585,
  590,600,610,620,630,635,645,655,665,675,680,690,700,710,720,725,735,745,755,765,
  770,780,790,800,810,815,825,835,845,855,860,870,880,890,900,905,915,925,935,945,950
};

float getSoCFromLookup(uint16_t raw) {
  if (raw >= socToBms[100]) return 100.0f;
  if (raw <= socToBms[0]) return 0.0f;

  for (int i = 0; i < 100; i++) {
    if (raw >= socToBms[i] && raw <= socToBms[i + 1]) {
      float range = (float)(socToBms[i + 1] - socToBms[i]);
      float delta = (float)(raw - socToBms[i]);
      if (range == 0) return (float)i;
      return (float)i + (delta / range);
    }
  }
  return 0.0f;
}

