squallbayu/votol-esp32-can-bus/esp32/votol_ble_dualcore/votol_ble_dualcore.ino
    atomicMode.store(newMode, std::memory_order_release);

    // Update non-critical data with Mutex
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      valRPM = rpm;
      valSpeed = speed;
      valCtrlTemp = msg.data[4];
      valMotorTemp = msg.data[5];
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // Battery temp sensors
  if (id == 0x0E6C0D09 && msg.data_length_code >= 5) {
     if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      int sum = 0;
      for (int i = 0; i < 5; i++) {
        valCellTemps[i] = msg.data[i];
        sum += (int)valCellTemps[i];
      }
      valBattTemp = sum / 5;
      xSemaphoreGive(dataMutex);
     }
    return;
  }

  // General info 1 (Voltage/Current/Capacity) - CRITICAL FOR REAL-TIME AMPERE
  if (id == 0x0A6D0D09 && msg.data_length_code >= 8) {
    // OPTIMIZATION: Decode and update Atomic variables IMMEDIATELY (No Mutex needed)
    uint16_t vRaw = (uint16_t)((msg.data[0] << 8) | msg.data[1]);
    float volts = vRaw * 0.1f;
    atomicVoltsRaw.store((int32_t)(volts * 10.0f), std::memory_order_release);

    uint16_t iRawU = (uint16_t)((msg.data[2] << 8) | msg.data[3]);
    int16_t iRawS = (int16_t)iRawU;
    float ampere = iRawS * 0.1f;
    atomicAmpereRaw.store((int32_t)(ampere * 10.0f), std::memory_order_release);

    float power = volts * ampere;
    atomicPowerRaw.store((int32_t)power, std::memory_order_release);

    // Update non-critical shared data with Mutex
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      if (fabs(ampere) < 0.2f) ampere = 0.0f; // Zero clamping for display
      valVolts = volts;
      valAmpere = ampere;
      valPower = power;
      rawVoltageHex = vRaw;
      rawCurrentHex = iRawU;

      uint16_t remainCap = (uint16_t)((msg.data[4] << 8) | msg.data[5]);
      valRemainingCapacity = remainCap * 0.1f;

      uint16_t fullCap = (uint16_t)((msg.data[6] << 8) | msg.data[7]);
      valFullCapacity = fullCap * 0.1f;
      
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // Battery health
  if (id == 0x0A6E0D09 && msg.data_length_code >= 6) {
    // Mark data ready BEFORE mutex (atomic, lock-free)
    // This ensures flag is set even if mutex temporarily unavailable
    canDataReady.store(true, std::memory_order_release);
    
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      uint16_t socVal = (uint16_t)((msg.data[0] << 8) | msg.data[1]);
      rawSOCHex = socVal;

      valSOC = (int)getSoCFromLookup(socVal);
      if (valSOC > 100) valSOC = 100;
      if (valSOC < 0) valSOC = 0;

      uint16_t sohVal = (uint16_t)((msg.data[2] << 8) | msg.data[3]);
      valSOH = (int)(sohVal * 0.1f);
      if (valSOH > 100) valSOH = 100;

      valCycleCount = (uint16_t)((msg.data[4] << 8) | msg.data[5]);
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // Cell voltage stats
  if (id == 0x0A6F0D09 && msg.data_length_code >= 8) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      valHighestCellVolt = (uint16_t)((msg.data[0] << 8) | msg.data[1]);
      valHighestCellNum  = msg.data[2];
      valLowestCellVolt  = (uint16_t)((msg.data[3] << 8) | msg.data[4]);
      valLowestCellNum   = msg.data[5];
      valAvgCellVolt     = (uint16_t)((msg.data[6] << 8) | msg.data[7]);
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // Temp stats
  if (id == 0x0A700D09 && msg.data_length_code >= 6) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      valMaxTemp = msg.data[0];
      valMaxTempCell = msg.data[1];
      valMinTemp = msg.data[4];
      valMinTempCell = msg.data[5];
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // Balance status
  if (id == 0x0A730D09 && msg.data_length_code >= 6) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      valBalanceMode = msg.data[0];
      valBalanceStatus = msg.data[1];
      valBalanceBits[0] = msg.data[2];
      valBalanceBits[1] = msg.data[3];
      valBalanceBits[2] = msg.data[4];
      valBalanceBits[3] = msg.data[5];

      snprintf(rawBalanceHexBuffer, sizeof(rawBalanceHexBuffer), "%02X %02X %02X %02X %02X %02X",
              msg.data[0], msg.data[1], msg.data[2], msg.data[3], msg.data[4], msg.data[5]);
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // Cell volt blocks 0x0E64..0x0E69
  if ((id & 0xFFF0FFFF) == 0x0E600D09) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      int baseIndex = -1;
      switch (id) {
        case 0x0E640D09: baseIndex = 0;  break;
        case 0x0E650D09: baseIndex = 4;  break;
        case 0x0E660D09: baseIndex = 8;  break;
        case 0x0E670D09: baseIndex = 12; break;
        case 0x0E680D09: baseIndex = 16; break;
        case 0x0E690D09: baseIndex = 20; break;
        default: break;
      }
      if (baseIndex >= 0) {
        for (int i = 0; i < 4 && (baseIndex + i) < 23; i++) {
          int off = i * 2;
          if (off + 1 < msg.data_length_code) {
            valCells[baseIndex + i] = (uint16_t)((msg.data[off] << 8) | msg.data[off + 1]);
          }
        }
      }
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // External Charger Messages (Protokol Charger)
  // Was labeled CCS/China Charger Standard, but could be generic.
  if ((id == 0x1810D0F3 || id == 0x1811D0F3) && msg.data_length_code >= 5) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      uint16_t vRaw = (uint16_t)((msg.data[0] << 8) | msg.data[1]);
      valChargerVoltage = vRaw * 0.1f;

      uint16_t iRaw = (uint16_t)((msg.data[2] << 8) | msg.data[3]);
      valChargerCurrent = iRaw * 0.1f;

      valChargerStatus = msg.data[4];
      chargerConnected = true;
      lastChargerMsg = millis();
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // BMS Charging Flag (0x0AB40D09) - byte[0]=1 when charging
  if (id == 0x0AB40D09 && msg.data_length_code >= 1) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      bmsChargingFlag = (msg.data[0] == 0x01);
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // BMS Hardware Version (0x0A750D09) - ASCII "H:v21"
  if (id == 0x0A750D09 && msg.data_length_code >= 6) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      size_t copyLen = min((size_t)msg.data_length_code, sizeof(bmsHwVersion) - 1);
      memcpy(bmsHwVersion, msg.data, copyLen);
      bmsHwVersion[copyLen] = '\0';
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // BMS Firmware Version (0x0A760D09) - ASCII "F:v23"
  if (id == 0x0A760D09 && msg.data_length_code >= 6) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      size_t copyLen = min((size_t)msg.data_length_code, sizeof(bmsFwVersion) - 1);
      memcpy(bmsFwVersion, msg.data, copyLen);
      bmsFwVersion[copyLen] = '\0';
      xSemaphoreGive(dataMutex);
    }
    return;
  }

  // ORI Charger Detection (0x10261041) - only present with original charger
  if (id == 0x10261041) {
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      oriChargerDetected = true;
      lastOriChargerMsg = millis();
      xSemaphoreGive(dataMutex);
    }
    return;
  }



