squallbayu/votol-esp32-can-bus/esp32/votol_ble_dualcore/votol_ble_dualcore.ino
}

// Check if TWAI bus is healthy before transmitting
bool isCanBusHealthy() {
  twai_status_info_t status;
  if (twai_get_status_info(&status) != ESP_OK) return false;
  if (status.state == TWAI_STATE_BUS_OFF) {
    Serial.println("[CAN] BUS-OFF detected! Recovering...");
    twai_initiate_recovery();
    return false;
  }
  if (status.state == TWAI_STATE_RECOVERING) return false;
  return (status.state == TWAI_STATE_RUNNING);
}

// =============================================
// DYNAMIC TWAI MODE SWITCHER
// =============================================
bool currentTwaiModeNormal = false; // By default we start in LISTEN_ONLY (false)

void switchTwaiMode(bool normalMode) {
  if (currentTwaiModeNormal == normalMode) return; // Already in target mode

  // Stop and uninstall the current driver
  twai_stop();
  twai_driver_uninstall();

  // Re-install with new mode
  twai_mode_t newMode = normalMode ? TWAI_MODE_NORMAL : TWAI_MODE_LISTEN_ONLY;
  twai_general_config_t g_config = TWAI_GENERAL_CONFIG_DEFAULT(CAN_TX_PIN, CAN_RX_PIN, newMode);
  g_config.rx_queue_len = 50; // Use larger queue to prevent data loss 
  
  twai_timing_config_t t_config = TWAI_TIMING_CONFIG_250KBITS();
  twai_filter_config_t f_config = TWAI_FILTER_CONFIG_ACCEPT_ALL();

  if (twai_driver_install(&g_config, &t_config, &f_config) == ESP_OK) {
    if (twai_start() == ESP_OK) {
      currentTwaiModeNormal = normalMode;
      // Serial.printf("[CAN] Switched mode to %s\n", normalMode ? "NORMAL" : "LISTEN_ONLY");
    } else {
      Serial.println("[CAN] ERROR: Failed to start after mode switch!");
    }
  } else {
    Serial.println("[CAN] ERROR: Failed to install after mode switch!");
  }
}

// =============================================
// CAN INJECTOR (Simulate Original Charger)
// =============================================
void injectChargerMessage() {
  // Before injecting, we MUST be in NORMAL mode to allow TX (Transmit)
  switchTwaiMode(true);
  
  if (!isCanBusHealthy()) {
    switchTwaiMode(false); // Revert back if not healthy
    return;
  }
  
  twai_message_t tx_msg;
  memset(&tx_msg, 0, sizeof(tx_msg));  // Zero-init ALL fields (critical: rtr must be 0)
  tx_msg.identifier = 0x10261041;
  tx_msg.extd = 1;
  tx_msg.data_length_code = 8;
  tx_msg.data[0] = 0x05;
  tx_msg.data[1] = 0x0A;
  tx_msg.data[2] = 0x1C;
  tx_msg.data[3] = 0x00;
  tx_msg.data[4] = 0x00;
  tx_msg.data[5] = 0x00;
  tx_msg.data[6] = 0x00;
  tx_msg.data[7] = 0x00;

  // Queue the message for transmission with short timeout
  // Try once with small wait, if fails just skip this cycle
  esp_err_t result = twai_transmit(&tx_msg, pdMS_TO_TICKS(5));
  if (result != ESP_OK && result != ESP_ERR_TIMEOUT) {
    // Only log on unexpected errors, not on timeout (queue full)
    // Serial.printf("[CAN] Inject failed: %d\n", result);
  }
  
  // After injection we switch back to LISTEN_ONLY so we don't spam ACK to the speedometer
  switchTwaiMode(false);
}



// =============================================
// CAN TASK (Core 0 - High Priority)
// =============================================
void canTask(void *pvParameters) {
  
  twai_message_t message;
  bool gotMessage = false;
  static unsigned long lastInjectTime = 0;
  
  while (true) {
    gotMessage = false;
    
    // Drain CAN RX queue (Rate Limited) - Process as many as possible to avoid queue overflow
    while (twai_receive(&message, 0) == ESP_OK) {
      handleCANMessage(message);
      canMsgCount++;
      gotMessage = true;
    }

    // LED feedback
    if (gotMessage) {
      digitalWrite(LED_PIN, HIGH);
      lastLEDBlink = millis();
      ledState = true;
    } else if (ledState && (millis() - lastLEDBlink > 50)) {
      digitalWrite(LED_PIN, LOW);
      ledState = false;
    }

    // CAN rate per second
    uint32_t nowSec = millis() / 1000;
    if (nowSec != lastSecond) {
      canMessagesPerSec.store(canMsgCount, std::memory_order_release);
      canMsgCount = 0;
      lastSecond = nowSec;
    }

    // === HYBRID SOC SAVE STRATEGY ===
    // Reduces NVS writes from 17,280/day to ~3/day
    // Strategy 1: Periodic backup (every 1 hour when motor running)
    // Strategy 2: Shutdown save (CAN timeout = motor off)
    // Strategy 3: Shutdown handler save (esp_restart / clean shutdown)
    
    static unsigned long lastCanMessage = millis();  // Track last CAN activity
    
    // Update lastCanMessage if we got messages this loop
    if (gotMessage) {
      lastCanMessage = millis();
      shutdownSaved = false;  // Reset shutdown flag when motor active
    }
    
    uint32_t canAge = millis() - lastCanMessage;
    bool motorRunning = (canAge < 5000);  // Motor running if CAN active within 5s
    
    // SAVE STRATEGY #1: Shutdown Detection (CAN timeout)
    // Save once when motor turns off (30s no CAN = shutdown)
    if (canAge > CAN_TIMEOUT_MS && !shutdownSaved) {
      bool dataReady = canDataReady.load(std::memory_order_acquire);
      int currentSoc = 0;
      
      if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
        currentSoc = valSOC;
        xSemaphoreGive(dataMutex);
      }
      
      if (dataReady && currentSoc >= 0 && currentSoc <= 100) {
        nvsWriteInt("soc", currentSoc);
        Serial.printf("[SOC-SAVE] Shutdown detected - SOC saved: %d%% (CAN inactive)\n", currentSoc);
        shutdownSaved = true;  // Prevent multiple saves
      }
    }
    
    // SAVE STRATEGY #2: Periodic Backup (every 1 hour when motor running)
    // Safety net in case of crash/unexpected shutdown
    if (motorRunning && millis() - lastPeriodicSave > SOC_PERIODIC_SAVE_MS) {
      bool dataReady = canDataReady.load(std::memory_order_acquire);
      int currentSoc = 0;
      
      if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
        currentSoc = valSOC;
        xSemaphoreGive(dataMutex);
      }
      
      if (dataReady && currentSoc >= 0 && currentSoc <= 100) {
        nvsWriteInt("soc", currentSoc);
        Serial.printf("[SOC-SAVE] Periodic backup - SOC saved: %d%%\n", currentSoc);
        lastPeriodicSave = millis();
      }
    }


    // Snapshot shared variables ONCE under mutex for this iteration
    bool localChargerConnected = false;
    bool localOriChargerDetected = false;
    unsigned long localLastChargerMsg = 0;
    unsigned long localLastOriChargerMsg = 0;
    bool localBmsCharging = false;
    
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      localChargerConnected = chargerConnected;
      localOriChargerDetected = oriChargerDetected;
      localLastChargerMsg = lastChargerMsg;
      localLastOriChargerMsg = lastOriChargerMsg;
      localBmsCharging = bmsChargingFlag;
      xSemaphoreGive(dataMutex);
    }

