squallbayu/votol-esp32-can-bus/esp32/votol_ble_dualcore/votol_ble_dualcore.ino
    // Charger timeout - reset chargerConnected if no CAN message
    if (localChargerConnected && (millis() - localLastChargerMsg > CHARGER_TIMEOUT_MS)) {
      if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
        chargerConnected = false;
        valChargerVoltage = 0.0f;
        valChargerCurrent = 0.0f;
        valChargerStatus = 0;
        xSemaphoreGive(dataMutex);
      }
      localChargerConnected = false; // Update local snapshot
    }

    // ORI Charger timeout - reset if no CAN message
    if (localOriChargerDetected && (millis() - localLastOriChargerMsg > ORI_CHARGER_TIMEOUT_MS)) {
      if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
        oriChargerDetected = false;
        xSemaphoreGive(dataMutex);
      }
    }

    // Injector Logic for Third-Party Charger
    // FIX: Add charger disconnect detection to prevent injection after charger is unplugged
    // Only inject if:
    // 1. Injector enabled by user
    // 2. BMS reports charging state
    // 3. ORI charger not detected (timeout 2s)
    // 4. External charger is ACTUALLY connected (chargerConnected flag valid, not timed out)
    // 5. Charging current is positive (>1A to filter out noise/REGEN)
    // This prevents false "charging" indication during REGEN after charger disconnect
    
    // Snapshot current ampere value under mutex
    float currentAmpere = 0.0f;
    if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
      currentAmpere = valAmpere;
      xSemaphoreGive(dataMutex);
    }
    
    // Only inject if charger is physically connected AND charging current is positive
    bool chargerActuallyActive = localChargerConnected && 
                                 (millis() - localLastChargerMsg < CHARGER_TIMEOUT_MS) &&
                                 (currentAmpere > 1.0f);  // Positive current >1A = real charging
    
    if (isInjectorEnabled.load(std::memory_order_acquire) && 
        localBmsCharging && 
        (millis() - localLastOriChargerMsg > 2000) &&
        chargerActuallyActive) {
       if (millis() - lastInjectTime > INJECTOR_INTERVAL_MS) {
         injectChargerMessage();
         lastInjectTime = millis();
       }
    }



    // Adaptive rate limiting: faster when driving, slower when charging
    // Driving: 50Hz (20ms) for responsive real-time data
    // Charging: 20Hz (50ms) to reduce CPU load during charger data flood
    // OTA Active: 5Hz (200ms) to prioritize flash writing
    if (isOtaInProgress()) {
      vTaskDelay(pdMS_TO_TICKS(200));
    } else {
      vTaskDelay(pdMS_TO_TICKS(localChargerConnected ? 50 : 20));
    }
  }
}

// Build FAST JSON - Critical real-time data only (~200-300 bytes)
static bool buildFastJson() {
  // Read atomic values (no mutex needed)
  int localRPM = atomicRPM.load(std::memory_order_acquire);
  int localSpeed = atomicSpeed.load(std::memory_order_acquire);
  float localAmpere = atomicAmpereRaw.load(std::memory_order_acquire) / 10.0f;
  float localVolts = atomicVoltsRaw.load(std::memory_order_acquire) / 10.0f;
  float localPower = (float)atomicPowerRaw.load(std::memory_order_acquire);
  VehicleMode localMode = atomicMode.load(std::memory_order_acquire);

  // Read other critical data under mutex
  int localSOC, localCtrlTemp, localMotorTemp, localBattTemp;

  uint32_t localCanRate;

  if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
    localSOC = valSOC;
    localCtrlTemp = valCtrlTemp;
    localMotorTemp = valMotorTemp;
    localBattTemp = valBattTemp;
    localCanRate = canMessagesPerSec.load(std::memory_order_acquire);

    xSemaphoreGive(dataMutex);
  } else {
    return false; // Skip if can't get mutex
  }

  // Build compact JSON with abbreviated field names
  int fastLen = snprintf(bleTxBuf, sizeof(bleTxBuf),
    "{\"r\":%d,"           // rpm
    "\"s\":%d,"           // speed
    "\"m\":\"%s\","       // mode
    "\"v\":%.1f,"         // volts
    "\"a\":%.1f,"         // amps
    "\"p\":%.0f,"         // power
    "\"sc\":%d,"          // soc
    "\"t\":{\"c\":%d,\"m\":%d,\"b\":%d},"  // temps: ctrl, motor, batt
    "\"cr\":%lu,"         // canRate
    "\"hb\":%lu,"         // heartbeat
    "\"type\":\"fast\""   // indicator for fast update
    "}\n",
    localRPM, localSpeed, getModeString(localMode),
    localVolts, localAmpere, localPower, localSOC,
    localCtrlTemp, localMotorTemp, localBattTemp,
    (unsigned long)localCanRate,
    (unsigned long)heartbeatCounter++
  );
  if (fastLen < 0) fastLen = 0;
  if ((size_t)fastLen >= sizeof(bleTxBuf)) {
    bleTxLen = sizeof(bleTxBuf) - 1;
  } else {
    bleTxLen = (uint16_t)fastLen;
  }
  return true;
}

// Build FULL JSON - Complete data including cells, balance, health (~1.5-2KB)
static bool buildFullJson() {
  // Read atomic values FIRST (no mutex needed, always fresh)
  int localRPM = atomicRPM.load(std::memory_order_acquire);
  int localSpeed = atomicSpeed.load(std::memory_order_acquire);
  float localAmpere = atomicAmpereRaw.load(std::memory_order_acquire) / 10.0f;
  float localVolts = atomicVoltsRaw.load(std::memory_order_acquire) / 10.0f;
  float localPower = (float)atomicPowerRaw.load(std::memory_order_acquire);
  VehicleMode localMode = atomicMode.load(std::memory_order_acquire);

  // Local copies for thread safety (non-critical data)
  int localSOC, localCtrlTemp, localMotorTemp, localBattTemp;
  int localSOH, localCycleCount;
  float localRemainingCap, localFullCap;
  uint16_t localCells[23];
  uint16_t localHighestVolt, localLowestVolt, localAvgVolt;
  uint8_t localHighestNum, localLowestNum;
  uint8_t localMaxTemp, localMaxTempCell, localMinTemp, localMinTempCell;
  uint8_t localBalanceMode, localBalanceStatus, localBalanceBits[4];
  float localChargerVolt, localChargerCurrent;
  // localChargerStatus removed - unused
  bool localChargerConnected;
  unsigned long localLastChargerMsg;
  uint32_t localCanRate;
  // localRawCurrent, localRawVoltage, localRawSOC removed - unused in output
  // New BMS info
  bool localBmsChargingFlag;
  bool localOriCharger;
  unsigned long localLastOriChargerMsg;
  char localHwVersion[8];
  char localFwVersion[8];


