squallbayu/votol-esp32-can-bus/esp32/votol_ble_dualcore/votol_ble_dualcore.ino
  // Read non-critical data under mutex (short hold time)
  if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
    localSOC = valSOC;
    localCtrlTemp = valCtrlTemp;
    localMotorTemp = valMotorTemp;
    localBattTemp = valBattTemp;
    localSOH = valSOH;
    localCycleCount = valCycleCount;
    localRemainingCap = valRemainingCapacity;
    localFullCap = valFullCapacity;
    localHighestVolt = valHighestCellVolt;
    localHighestNum = valHighestCellNum;
    localLowestVolt = valLowestCellVolt;
    localLowestNum = valLowestCellNum;
    localAvgVolt = valAvgCellVolt;
    localMaxTemp = valMaxTemp;
    localMaxTempCell = valMaxTempCell;
    localMinTemp = valMinTemp;
    localMinTempCell = valMinTempCell;
    localBalanceMode = valBalanceMode;
    localBalanceStatus = valBalanceStatus;
    memcpy(localBalanceBits, valBalanceBits, 4);
    localChargerVolt = valChargerVoltage;
    localChargerCurrent = valChargerCurrent;
    // localChargerStatus not used in JSON output
    localChargerConnected = chargerConnected;
    localLastChargerMsg = lastChargerMsg;
    localCanRate = canMessagesPerSec.load(std::memory_order_acquire);
    // rawCurrentHex, rawVoltageHex, rawSOCHex not used in JSON output
    memcpy(localCells, valCells, sizeof(localCells));
    // New BMS info
    localBmsChargingFlag = bmsChargingFlag;
    localOriCharger = oriChargerDetected;
    localLastOriChargerMsg = lastOriChargerMsg;
    strcpy(localHwVersion, bmsHwVersion);
    strcpy(localFwVersion, bmsFwVersion);

    xSemaphoreGive(dataMutex);
  } else {
    // Fallback - use last known values
    return false;
  }

  // Note: Atomic values (RPM, speed, ampere, volts, power, mode) already read above

  // Calculate cell delta
  uint16_t minCell = 9999, maxCell = 0;
  for (int i = 0; i < 23; i++) {
    if (localCells[i] > 0 && localCells[i] < minCell) minCell = localCells[i];
    if (localCells[i] > maxCell) maxCell = localCells[i];
  }
  int cellDelta = (minCell > maxCell) ? 0 : ((int)maxCell - (int)minCell);

  // Build balance cells array string (compact: 0/1 instead of true/false)
  // 23 cells * 1 digit + 22 commas + null = 46 bytes, use 64 for safety
  char balanceCells[64];
  int bpos = 0;
  for (int i = 0; i < 23; i++) {
    int byteIndex = i / 8;
    int bitIndex = i % 8;
    bool isBalancing = (localBalanceBits[byteIndex] & (1 << bitIndex)) != 0;
    int written = snprintf(balanceCells + bpos, sizeof(balanceCells) - bpos, 
                     "%d%s", isBalancing ? 1 : 0, (i < 22) ? "," : "");
    if (written > 0) bpos += written;
  }

  // Build cells array string
  // 23 cells * max 5 digits (65535) + 22 commas + null = 138 bytes, use 160 for safety
  char cellsStr[160];
  int cpos = 0;
  for (int i = 0; i < 23; i++) {
    int written = snprintf(cellsStr + cpos, sizeof(cellsStr) - cpos, 
                     "%u%s", localCells[i], (i < 22) ? "," : "");
    if (written > 0) cpos += written;
  }

  // Build complete JSON with abbreviated field names
  int fullLen = snprintf(bleTxBuf, sizeof(bleTxBuf),
    "{\"r\":%d,"
    "\"s\":%d,"
    "\"m\":\"%s\","
    "\"v\":%.1f,"
    "\"a\":%.1f,"
    "\"p\":%.0f,"
    "\"sc\":%d,"
    "\"t\":{\"c\":%d,\"m\":%d,\"b\":%d},"
    "\"cells\":[%s],"
    "\"cd\":%d,"
    "\"cr\":%lu,"
    "\"h\":{\"soh\":%d,\"cyc\":%u,\"rc\":%.1f,\"fc\":%.1f},"
    "\"cvs\":{\"hi\":%u,\"hiC\":%u,\"lo\":%u,\"loC\":%u,\"av\":%u},"
    "\"ts\":{\"max\":%u,\"maxC\":%u,\"min\":%u,\"minC\":%u},"
    "\"b\":{\"md\":%u,\"st\":%u,\"cells\":[%s]},"
    "\"chr\":{\"on\":%d,\"v\":%.1f,\"a\":%.1f,\"ori\":%d},"
    "\"bms\":{\"hw\":\"%s\",\"fw\":\"%s\"},"
    "\"hb\":%lu,"
    "\"type\":\"full\""
    "}\n",
    localRPM, localSpeed, getModeString(localMode),
    localVolts, localAmpere, localPower, localSOC,
    localCtrlTemp, localMotorTemp, localBattTemp,
    cellsStr, cellDelta,
    (unsigned long)localCanRate,
    localSOH, localCycleCount, localRemainingCap, localFullCap,
    localHighestVolt, localHighestNum, localLowestVolt, localLowestNum, localAvgVolt,
    localMaxTemp, localMaxTempCell, localMinTemp, localMinTempCell,
    localBalanceMode, localBalanceStatus, balanceCells,
    localBmsChargingFlag ? 1 : 0,  // charger.on = 0/1
    (localChargerVolt > 0.1f) ? localChargerVolt : localVolts,      // Fallback to system volts
    (localChargerCurrent > 0.1f) ? localChargerCurrent : fabs(localAmpere), // Fallback to system amps
    (millis() - localLastOriChargerMsg < ORI_CHARGER_TIMEOUT_MS && localOriCharger) ? 1 : 0,  // charger.ori = 0/1
    localHwVersion, localFwVersion,
    (unsigned long)heartbeatCounter++
  );
  if (fullLen < 0) fullLen = 0;
  if ((size_t)fullLen >= sizeof(bleTxBuf)) {
    bleTxLen = sizeof(bleTxBuf) - 1;
  } else {
    bleTxLen = (uint16_t)fullLen;
  }
  return true;
}

static void startBleTxIfIdle(bool useFast) {
  if (!deviceConnected.load(std::memory_order_acquire)) return;
  if (bleTxInProgress) return;

  bool ok;
  if (useFast) {
    ok = buildFastJson();
  } else {
    ok = buildFullJson();
  }
  
  if (!ok) return; // SKIP jika build gagal, jangan kirim data stale
  
  bleTxOffset = 0;
  bleTxInProgress = true;
}

static void pumpBleTx() {
  if (!deviceConnected.load(std::memory_order_acquire)) {
    bleTxInProgress = false;
    bleTxOffset = 0;
    return;
  }
  if (!bleTxInProgress) return;

  if (bleTxOffset >= bleTxLen) {
    bleTxInProgress = false;
    return;
  }

  const uint32_t startUs = micros();
  int sent = 0;

  while (bleTxInProgress &&
         sent < BLE_PUMP_MAX_CHUNKS &&
         (micros() - startUs) < BLE_PUMP_BUDGET_US) {

    int remain = bleTxLen - (int)bleTxOffset;
    if (remain <= 0) {
      bleTxInProgress = false;
      break;
    }

    int chunkLen = min((int)BLE_SAFE_CHUNK, remain);
    const char *p = bleTxBuf + bleTxOffset;

    pCharacteristic->setValue((uint8_t*)p, chunkLen);
    pCharacteristic->notify();

    bleTxOffset += chunkLen;
    sent++;
  }

  if (bleTxOffset >= bleTxLen) bleTxInProgress = false;
}

// =============================================
// ADAPTIVE TIMING HELPERS
// =============================================
static uint32_t getFastUpdateInterval() {
  // Read current mode from atomic (no mutex needed)
  VehicleMode mode = atomicMode.load(std::memory_order_acquire);

