squallbayu/votol-esp32-can-bus/esp32/votol_ble_dualcore/votol_ble_dualcore.ino
  // Return interval based on mode
  switch (mode) {
    case MODE_PARK:
    case MODE_STAND:
      return PARK_FAST_MS;
    case MODE_CHARGING:
      return CHARGING_FAST_MS;
    case MODE_BRAKE:
      return BRAKE_FAST_MS;
    default:
      // DRIVE, SPORT, REVERSE
      return DRIVE_FAST_MS;
  }
}

static uint32_t getSlowUpdateInterval() {
  // Read current mode from atomic (no mutex needed)
  VehicleMode mode = atomicMode.load(std::memory_order_acquire);

  switch (mode) {
    case MODE_PARK:
    case MODE_STAND:
      return PARK_SLOW_MS;
    case MODE_CHARGING:
      return CHARGING_SLOW_MS;
    default:
      // DRIVE, SPORT, REVERSE, BRAKE
      return DRIVE_SLOW_MS;
  }
}



// =============================================
// BLE LIFECYCLE MANAGEMENT
// =============================================

// Shared BLE server initialization (eliminates duplication)
static void initBLEServer() {
  // Always reinitialize after deinit
  Serial.println("[BLE] Initializing BLE server...");
  
  // Ensure BT controller is started
  btStart();
  delay(100);
  
  BLEDevice::init(DEVICE_NAME);
  BLEDevice::setMTU(512);
  
  pServer = BLEDevice::createServer();
  static MyServerCallbacks serverCallbacks;
  pServer->setCallbacks(&serverCallbacks);
  
  BLEService *pService = pServer->createService(SERVICE_UUID);
  pCharacteristic = pService->createCharacteristic(
    CHARACTERISTIC_UUID,
    BLECharacteristic::PROPERTY_READ | 
    BLECharacteristic::PROPERTY_NOTIFY |
    BLECharacteristic::PROPERTY_WRITE
  );
  static BLE2902 ble2902Descriptor;
  pCharacteristic->addDescriptor(&ble2902Descriptor);
  static MyCallbacks charCallbacks;
  pCharacteristic->setCallbacks(&charCallbacks);
  pService->start();
  
  setupOtaService(pServer);
  
  Serial.println("[BLE] BLE server initialized successfully");
}

static void stopBLE() {
  Serial.println("[Comm] Stopping BLE...");
  
  if (pServer != nullptr) {
    // Disconnect any active clients gracefully
    if (deviceConnected.load(std::memory_order_acquire)) {
      Serial.println("[BLE] Disconnecting client...");
      delay(100);
    }
    
    // Stop advertising
    BLEAdvertising* pAdvertising = BLEDevice::getAdvertising();
    if (pAdvertising != nullptr) {
      pAdvertising->stop();
    }
  }
  
  deviceConnected.store(false, std::memory_order_release);
  oldDeviceConnected = false;
  
  // Fully deinit BLE to release Bluetooth controller
  // This is CRITICAL: ESP32 shares one radio between BLE and WiFi.
  // Without deinit, BT controller keeps the radio and WiFi AP fails to start.
  BLEDevice::deinit(false);  // false = don't release memory (we'll reinit later)
  pServer = nullptr;
  pCharacteristic = nullptr;
  delay(200);  // Let BT controller fully release
  
  // Stop Bluetooth controller at hardware level
  btStop();
  delay(100);
  
  Serial.println("[BLE] BLE fully stopped (controller released)");
}

static void startBLE() {
  Serial.println("[Comm] Starting BLE...");
  
  // Full reinitialize (server was deinit'd during stop)
  initBLEServer();
  
  // Configure and start advertising
  BLEAdvertising *pAdvertising = BLEDevice::getAdvertising();
  pAdvertising->addServiceUUID(SERVICE_UUID);
  pAdvertising->addServiceUUID(OTA_SERVICE_UUID);
  pAdvertising->setScanResponse(true);
  pAdvertising->setMinPreferred(0x06);
  pAdvertising->setMaxPreferred(0x12);
  BLEDevice::startAdvertising();
  
  Serial.println("[Comm] BLE active and advertising");
}


// WebSocket transmission state
static uint32_t lastWsFastSend = 0;
static uint32_t lastWsSlowSend = 0;
static char wsTxBuf[2200];

static void sendWsFastUpdate() {
  // Read atomic values (no mutex needed)
  int localRPM = atomicRPM.load(std::memory_order_acquire);
  int localSpeed = atomicSpeed.load(std::memory_order_acquire);
  float localAmpere = atomicAmpereRaw.load(std::memory_order_acquire) / 10.0f;
  float localVolts = atomicVoltsRaw.load(std::memory_order_acquire) / 10.0f;
  float localPower = (float)atomicPowerRaw.load(std::memory_order_acquire);
  VehicleMode localMode = atomicMode.load(std::memory_order_acquire);

  int localSOC = 0, localCtrlTemp = 0, localMotorTemp = 0, localBattTemp = 0;
  uint32_t localCanRate = 0;


  if (xSemaphoreTake(dataMutex, pdMS_TO_TICKS(MUTEX_TIMEOUT_MS)) == pdTRUE) {
    localSOC = valSOC;
    localCtrlTemp = valCtrlTemp;
    localMotorTemp = valMotorTemp;
    localBattTemp = valBattTemp;
    localCanRate = canMessagesPerSec.load(std::memory_order_acquire);

    xSemaphoreGive(dataMutex);
  } else {
    return; // Skip broadcast, jangan kirim data default 0
  }

  int len = snprintf(wsTxBuf, sizeof(wsTxBuf),
    "{\"r\":%d,\"s\":%d,\"m\":\"%s\",\"v\":%.1f,\"a\":%.1f,\"p\":%.0f,\"sc\":%d,\"t\":{\"c\":%d,\"m\":%d,\"b\":%d},\"cr\":%lu,\"hb\":%lu,\"type\":\"fast\"}\n",
    localRPM, localSpeed, getModeString(localMode),
    localVolts, localAmpere, localPower, localSOC,
    localCtrlTemp, localMotorTemp, localBattTemp,
    (unsigned long)localCanRate,
    (unsigned long)heartbeatCounter++
  );
  
  if (len > 0 && len < (int)sizeof(wsTxBuf)) {
    wsBroadcast(wsTxBuf);
  }
}

static void sendWsSlowUpdate() {
  // Build full JSON (same logic as BLE)
  if (buildFullJson()) {  // Hanya broadcast kalau berhasil
    wsBroadcast(bleTxBuf);
  }
}

void commTask(void *pvParameters) {
  // Read initial mode from NVS (set in setup())
  TransportMode currentMode = transportMode.load(std::memory_order_acquire);
  
  if (currentMode == TRANSPORT_WIFI) {
    Serial.println("[Comm] Starting in WiFi mode (from saved preference)");
    // Start WiFi immediately
    initWiFiMode();
  } else {
    Serial.println("[Comm] Starting in BLE mode (Manual Switch Only)");
    // BLE already initialized in setup()
  }
  
  while (true) {
    TransportMode requestedMode = transportMode.load(std::memory_order_acquire);
    
    // No auto-switch logic anymore
    // We just listen to requestedMode changes from callbacks
    
    // === Mode Switch Logic ===
    if (requestedMode != currentMode) {
      Serial.println("========================================");
      Serial.printf("[SWITCH] %s → %s\n", 
                    currentMode == TRANSPORT_BLE ? "BLE" : "WiFi",
                    requestedMode == TRANSPORT_BLE ? "BLE" : "WiFi");
      Serial.println("========================================");
      
      unsigned long switchStart = millis();
      
      if (requestedMode == TRANSPORT_WIFI && currentMode == TRANSPORT_BLE) {
        // Switch from BLE to WiFi
        Serial.println("[SWITCH] Step 1/3: Stopping BLE completely...");
        stopBLE();  // Full deinit + btStop()
        delay(500); // Let radio fully release before WiFi takes over
        
        Serial.println("[SWITCH] Step 2/3: Starting WiFi AP...");
        initWiFiMode();  // This handles WiFi init
        
        Serial.println("[SWITCH] Step 3/3: WiFi ready!");
        currentMode = TRANSPORT_WIFI;
        
      } else if (requestedMode == TRANSPORT_BLE && currentMode == TRANSPORT_WIFI) {
        // Switch from WiFi to BLE
        Serial.println("[SWITCH] Step 1/3: Stopping WiFi...");
        stopWiFiMode();
        delay(500); // Let WiFi radio fully release
        
