squallbayu/votol-esp32-can-bus/esp32/votol_ble_dualcore/votol_ble_dualcore.ino
        Serial.println("[SWITCH] Step 2/3: Starting BLE...");
        startBLE();  // Full reinit (btStart + BLEDevice::init)
        
        Serial.println("[SWITCH] Step 3/3: BLE ready!");
        currentMode = TRANSPORT_BLE;
      }
      
      unsigned long switchTime = millis() - switchStart;
      Serial.printf("[SWITCH] Complete! Time: %lums\n", switchTime);
      Serial.println("========================================\n");
    }
    
    // === Handle current mode ===
    if (currentMode == TRANSPORT_WIFI) {
      // === WIFI MODE ===
      handleWiFiLoop();
      
      // WebSocket transmission
      if (isWsClientConnected()) {
        uint32_t now = millis();
        uint32_t fastInterval = getFastUpdateInterval();
        uint32_t slowInterval = getSlowUpdateInterval();
        
        if (now - lastWsSlowSend >= slowInterval) {
          lastWsSlowSend = now;
          lastWsFastSend = now;
          sendWsSlowUpdate();
        } else if (now - lastWsFastSend >= fastInterval) {
          lastWsFastSend = now;
          sendWsFastUpdate();
        }
      }
      
      vTaskDelay(pdMS_TO_TICKS(5));
      
    } else if (currentMode == TRANSPORT_BLE) {
      // === BLE MODE ===
      
      // Skip BLE operations if not initialized (e.g., started in WiFi mode)
      if (pServer == nullptr || pCharacteristic == nullptr) {
        vTaskDelay(pdMS_TO_TICKS(100));
        continue;
      }
      
      // BLE reconnect advertising
      bool connected = deviceConnected.load(std::memory_order_acquire);
      if (!connected && oldDeviceConnected) {
        delay(200);
        pServer->startAdvertising();
        oldDeviceConnected = connected;
      }
      if (connected && !oldDeviceConnected) {
        oldDeviceConnected = connected;
      }

      // Adaptive dual-rate transmission logic
      uint32_t now = millis();
      
      if (!bleTxInProgress) {
        uint32_t fastInterval = getFastUpdateInterval();
        uint32_t slowInterval = getSlowUpdateInterval();
        
        if (now - lastSlowSend >= slowInterval) {
          lastSlowSend = now;
          lastFastSend = now;
          startBleTxIfIdle(false);
        } else if (now - lastFastSend >= fastInterval) {
          lastFastSend = now;
          startBleTxIfIdle(true);
        }
      }

      // Handle OTA reboot (safely outside BLE callback context)
      if (isOtaRebootPending()) {
        Serial.println("[OTA] Rebooting now...");
        delay(2000);  // Give BLE stack time to send final status
        ESP.restart();
      }

      // Pump BLE chunks
      if (!isOtaInProgress()) {
        pumpBleTx();
        checkOtaTimeout();
        vTaskDelay(pdMS_TO_TICKS(2));
      } else {
        checkOtaTimeout();
        vTaskDelay(pdMS_TO_TICKS(50));
      }
    }
  }
}

// =============================================
// SHUTDOWN HANDLER - Save SOC on Clean Restart
// =============================================
// SAVE STRATEGY #3: Save SOC during esp_restart() / clean shutdown.
// NOTE: This is NOT a brownout handler. For true power-cut protection,
// SOC is periodically saved to NVS (Strategy #1/#2) and could be
// backed up to RTC memory if needed.
void shutdownHandler() {
  // Direct save to NVS (bypass mutex - we're shutting down, single-threaded)
  preferences.putInt("soc", valSOC);
  preferences.end();  // Flush to ensure write completes
}

// =============================================
// SETUP
// =============================================
void setup() {
  Serial.begin(115200);
  delay(100);
  Serial.println("\n[Init] VOTOL BLE+WiFi Dashboard Starting...");
  
  pinMode(LED_PIN, OUTPUT);
  digitalWrite(LED_PIN, LOW);

  // Create mutex
  dataMutex = xSemaphoreCreateMutex();
  nvsMutex = xSemaphoreCreateMutex();
  if (dataMutex == NULL || nvsMutex == NULL) {
    while(1); // Critical error - halt
  }

  preferences.begin("votol", false);
  valSOC = preferences.getInt("soc", 0);
  
  // Initialize SOC save state
  lastPeriodicSave = millis();  // Start periodic timer
  shutdownSaved = false;        // Reset shutdown flag
  
  isInjectorEnabled.store(preferences.getBool("inj", false), std::memory_order_relaxed);
  
  // Register shutdown handler for clean restart SOC saves
  esp_register_shutdown_handler(shutdownHandler);
  Serial.println("[Init] Shutdown handler registered for SOC saves");
  
  // Load saved transport mode (BLE or WiFi)
  String savedMode = preferences.getString("mode", "BLE");
  TransportMode initialMode = (savedMode == "WIFI") ? TRANSPORT_WIFI : TRANSPORT_BLE;
  transportMode.store(initialMode, std::memory_order_release);
  Serial.printf("[Init] Saved mode: %s\n", savedMode.c_str());

  // BLE Setup - Only if starting in BLE mode
  if (initialMode == TRANSPORT_BLE) {
    Serial.println("[Init] Initializing BLE mode...");
    startBLE();  // Use shared function (configures advertising UUIDs + starts)
    Serial.println("[Init] BLE started and advertising");
    Serial.println("[Init] Send 'WIFI:ON' via Serial to switch to WiFi mode");
  } else {
    Serial.println("[Init] WiFi mode selected - BLE not started");
    Serial.println("[Init] WiFi AP will start in commTask...");
    pServer = nullptr;
    pCharacteristic = nullptr;
  }

  // CAN (TWAI) Setup - Use LISTEN_ONLY as default to prevent ACK clashes with speedometer
  twai_general_config_t g_config =
      TWAI_GENERAL_CONFIG_DEFAULT(CAN_TX_PIN, CAN_RX_PIN, TWAI_MODE_LISTEN_ONLY);
  g_config.rx_queue_len = 50; // Increase queue to prevent stale data buildup & drops

  twai_timing_config_t t_config = TWAI_TIMING_CONFIG_250KBITS();
  twai_filter_config_t f_config = TWAI_FILTER_CONFIG_ACCEPT_ALL();

  if (twai_driver_install(&g_config, &t_config, &f_config) == ESP_OK) {
    twai_start();
  }

  // Create tasks on specific cores
  xTaskCreatePinnedToCore(
    canTask,              // Task function
    "CAN_Task",           // Name
    CAN_TASK_STACK_SIZE,  // Stack size
    NULL,                 // Parameters
    CAN_TASK_PRIORITY,    // Priority (higher = more important)
    &canTaskHandle,       // Task handle
    0                     // Core 0
  );

  xTaskCreatePinnedToCore(
    commTask,
    "Comm_Task",
    BLE_TASK_STACK_SIZE,
    NULL,
    BLE_TASK_PRIORITY,
    &bleTaskHandle,
    1                     // Core 1
  );


}

// =============================================
// LOOP (empty - tasks handle everything)
// =============================================
void loop() {
  // Serial Command Handler for Manual Switching
  static TransportMode lastSavedMode = transportMode.load(std::memory_order_acquire);
  
  if (Serial.available()) {
    String input = Serial.readStringUntil('\n');
    input.trim();
    
    if (input.equalsIgnoreCase("WIFI:ON")) {
      Serial.println("[Serial] Command received: Switch to WiFi");
      transportMode.store(TRANSPORT_WIFI, std::memory_order_release);
      // Mode saved by auto-save below
    } 
    else if (input.equalsIgnoreCase("BLE:ON")) {
      Serial.println("[Serial] Command received: Switch to BLE");
      transportMode.store(TRANSPORT_BLE, std::memory_order_release);
      // Mode saved by auto-save below
    }
    else if (input.length() > 0) {
      Serial.println("[Serial] Unknown command: " + input);
    }
  }
  
  // Auto-save mode changes
  TransportMode current = transportMode.load(std::memory_order_acquire);
  if (current != lastSavedMode) {
    nvsWriteString("mode", (current == TRANSPORT_WIFI) ? "WIFI" : "BLE");
    lastSavedMode = current;
    Serial.printf("[Main] Mode saved: %s\n", (current == TRANSPORT_WIFI) ? "WIFI" : "BLE");
  }
  
  vTaskDelay(pdMS_TO_TICKS(100));
}
